// 1数字  number
//  关键字var  变量名称a  赋值=   值
// var a = 9
// console.log(a)
// var b = 3
// console.log(b)
// var c = a % b;
// console.log(c)

// 2字符串 ""  ''
// var a = '今天天气乌云密布'
// var b = "因为天气不好，所以心情不好"
// var c = "虽然心情不好，我还是要学习"
// var d = a + b + c
// console.log(d)

// var a = 123;
// var b = "我有"
// var c = "多钱"

// //输出  我有123多钱
// console.log(b + a + c)

//3空  null
// var b = null
// var a = null;


//4 undefined
// var a
// console.log(a)
// a = 123;
// console.log(a)

// 5 布尔  boolean
// var a = true;
// var b = false;

// 字符转的长度放在length属性上
// var a = '打好大夫我'
// var b= a.length
// var c = a[2]
// console.log(c)

// var a = "今天天气了"
// //       0 1 2 3 4
// var b = "大风"
// // var c = a[0]
// // var d = a[1]
// // var e = a[2]
// // var f = a[3]

// var l = a.slice(0,4)


// var g = a[a.length - 1]

// alert(l+ b + g)


// // 今天天气大风了


// 数字 
// nan   not a number
// Infinity   无穷
// var a = "qwe";
// var b = "123";
// var c = a - b;
// console.log(c)


// var a = -12312111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111231211111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111123121111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111112312111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111231211111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111123121111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111112312111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111
// console.log(a)

// var a = false;
// var b = (typeof(a))
// // typeof(a)  =>   "string"
// // typeof("string")  =>  "string"
// console.log(b)

var a = Math.floor(Math.random() * 38 +1)
alert(a)